ZzqiZQute/stm32f10x_oledvideo/stm32_oledvideo_player_ucosiii/Project/main.c
#include "stm32f10x.h"                  // Device header
#include "includes.h"
#include "task.h"
#include "LED.h"
#include "delay.h"
#include "usart.h"
#include "iic.h"
#include "MMC_SD.h" 
#include "ff.h"  
#include "exfuns.h"
#include "oled_spi.h"
#include "timer.h"
void BSP_init(void);
 
int main()
{  
	OS_ERR err;
	CPU_SR_ALLOC();
	BSP_init();
	
	OSInit(&err); 
	OS_CRITICAL_ENTER();
	OSTaskCreate((OS_TCB 	* )&StartTaskTCB,		//任务控制块
				 (CPU_CHAR	* )"start task", 		//任务名字
                 (OS_TASK_PTR )start_task, 			//任务函数
                 (void		* )0,					//传递给任务函数的参数
                 (OS_PRIO	  )START_TASK_PRIO,     //任务优先级
                 (CPU_STK   * )&START_TASK_STK[0],	//任务堆栈基地址
                 (CPU_STK_SIZE)START_STK_SIZE/10,	//任务堆栈深度限位
                 (CPU_STK_SIZE)START_STK_SIZE,		//任务堆栈大小
                 (OS_MSG_QTY  )0,					//任务内部消息队列能够接收的最大消息数目,为0时禁止接收消息
                 (OS_TICK	  )0,					//当使能时间片轮转时的时间片长度，为0时为默认长度，
                 (void   	* )0,					//用户补充的存储区
                 (OS_OPT      )OS_OPT_TASK_STK_CHK|OS_OPT_TASK_STK_CLR, //任务选项
                 (OS_ERR 	* )&err);				//存放该函数错误时的返回值
	OS_CRITICAL_EXIT();
	OSStart(&err);
	
	while(1){}
}



void BSP_init(void)
{
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	delay_init();  
	IIC_Init();
	LED_init();
	OLED_Init();
	OLED_Clear();
	Timer_Init();
	while(SD_Initialize())					
	{
	
	}
	exfuns_init();								 
  f_mount(fs[0],"0:",1); 					
	uart_init(115200);
	
}

